{
  "en": {
    "title": "Terms of Service — Brainstorm Buddy",
    "dates-line": "Effective date: 20 September 2025 &nbsp;•&nbsp; Last updated: 20 September 2025",
    "s1-heading": "1) Who we are and how to contact us",
    "s1-text": "<p>Brainstorm Buddy (the “Service”) is provided by Ibrahim Ahmed (“we”, “us”, “our”).</p><p>Address: 167–169 Great Portland Street, 5th Floor, London, W1W 5PF, UK</p><p>Email: <a href=\\\"mailto:brainstormbuddyy@gmail.com\\\">brainstormbuddyy@gmail.com</a></p><p>If you have a privacy question or complaint, you can also contact the UK Information Commissioner’s Office (ICO) at <a href=\\\"https://ico.org.uk\\\" target=\\\"_blank\\\" rel=\\\"noopener\\\">ico.org.uk</a>.</p>",
    "s2-heading": "2) What these Terms do",
    "s2-text": "<p>These Terms of Service (“Terms”) govern your access to and use of the Service (including our extension, website, and related features). By using the Service, you agree to these Terms and to our Privacy Policy (linked in the footer of our site/app). If you use the Service on behalf of a business, you confirm you’re authorised to bind that business.</p>",
    "s3-heading": "3) Your account",
    "s3-text": "<p>Some features require an account. Keep your credentials safe; you’re responsible for activity on your account. Tell us promptly if you suspect unauthorised use.</p>",
    "s4-heading": "4) AI-generated content (important)",
    "s4-text": "<p>Brainstorm Buddy uses AI (including services from OpenAI) to generate ideas and draft content. AI outputs can be inaccurate, incomplete, or inappropriate and are not professional advice. By using AI features, you agree that:</p><ul><li>You are responsible for how you use and interpret outputs (including fact-checking and compliance with law).</li><li>We provide the Service “as is” for creativity and productivity purposes and do not guarantee accuracy or fitness for a particular purpose.</li></ul>",
    "s5-heading": "5) Acceptable use",
    "s5-text": "<p>You must not use the Service to:</p><ul><li>Break the law or infringe others’ rights (including copyright and trademarks).</li><li>Produce or share illegal, deceptive, harmful, or privacy-invasive content; malware; or content that facilitates harm.</li><li>Misrepresent AI outputs as factual without checks where accuracy matters.</li><li>Attempt to bypass technical limits, probe our systems, or create multiple accounts to evade limits.</li></ul><p>We may remove content, throttle usage, or suspend/terminate accounts for breaches or risks to safety, privacy, or system stability.</p>",
    "s6-heading": "6) Plans, usage limits, and fairness",
    "s6-text": "<p><strong>Plan name:</strong> Elite &nbsp;•&nbsp; <strong>Monthly allowance:</strong> up to 700 AI idea generations per month per account.</p><p>We may temporarily throttle or suspend access if you materially exceed allowances or misuse the Service. Creating multiple accounts to bypass limits is prohibited. We may publish updated operational thresholds from time to time to protect system health.</p>",
    "s7-heading": "7) Prices, auto-renewal, cancellations, and refunds",
    "s7-text": "<ul><li><strong>Auto-renewal.</strong> Subscriptions (monthly or annual) renew automatically until you cancel on the website in your account settings or by contacting us.</li><li><strong>Cooling-off for UK consumers.</strong> If you purchase online as a consumer, you have 14 days from purchase to cancel for any reason. If you ask us to start the service within the 14-day period, you acknowledge that once the service is fully performed you lose the right to cancel, and we may deduct a proportionate amount for services already provided. To cancel within the cooling-off period, use the in-app flow or email <a href=\\\"mailto:brainstormbuddyy@gmail.com\\\">brainstormbuddyy@gmail.com</a>.</li><li><strong>Refunds.</strong> <em>Monthly subscriptions:</em> You can cancel anytime to stop future renewals. Fees already paid are generally non-refundable, except where the 14-day cooling-off right applies (subject to any proportionate deduction if you asked us to start immediately). <em>Annual subscriptions:</em> You may cancel within 14 days of purchase under the cooling-off rules (subject to proportionate deduction if you asked us to start immediately). After 14 days, annual fees are non-refundable.</li><li><strong>Processing time:</strong> Refunds are typically processed within 5 to 10 business days to the original payment method.</li><li><strong>Refund abuse:</strong> To prevent misuse, we may limit future purchases or decline further refund requests if more than two refunds have been approved for the same account or payment method.</li><li>We will notify you before any price change takes effect on your next renewal.</li></ul>",
    "s8-heading": "8) Payments and third-party services",
    "s8-text": "<p>Payments are processed by Stripe. We also use services from Google (including Gmail) for communications and operations. Their terms and privacy policies apply to their services. See our Privacy Policy for details of data sharing and safeguards.</p>",
    "s9-heading": "9) Privacy and data protection",
    "s9-text": "<p>We are the data controller for personal data processed via the Service. We process data to provide, secure, and improve the Service and to communicate with you. Key points (see our Privacy Policy for full details):</p><ul><li>Lawful bases may include contract, legitimate interests, and consent (where applicable).</li><li>We use service providers (including OpenAI, Stripe, and Google) under contract.</li><li>Some processing may occur outside the UK with appropriate safeguards.</li><li>Your rights include access, rectification, erasure, restriction, portability, and objection, and the right to complain to the ICO.</li></ul>",
    "s10-heading": "10) Intellectual property",
    "s10-text": "<p>The Service, including software, content, and branding, is our property or our licensors’. Brainstorm Buddy is our trademark.</p><p><strong>Your inputs &amp; AI outputs.</strong> You retain rights in your input content. To operate the Service, you grant us a worldwide, royalty-free licence to host, process, and display your inputs and to generate outputs at your direction. Subject to third-party rights and these Terms, you may use the outputs for your purposes. You must ensure you have all necessary rights in your inputs.</p>",
    "s11-heading": "11) Service changes and availability",
    "s11-text": "<p>We may update or change features to improve performance or address security/legal requirements. If we make material changes that negatively impact you, we’ll give at least 30 days’ notice (by email or in-app) where reasonable, and you may cancel before the change takes effect. We aim for high availability but do not guarantee uninterrupted or error-free service. Planned maintenance will be announced where feasible.</p>",
    "s12-heading": "12) Suspension and termination",
    "s12-text": "<p>We may suspend or terminate your access if you materially or repeatedly breach these Terms or law; if your usage poses a security or stability risk; or if required by law or a provider. We’ll try to give reasonable notice where appropriate. On termination, your right to use the Service ends, but terms that should reasonably survive (e.g., IP, liability limits, refunds already processed) will continue. See our Privacy Policy for retention and deletion.</p>",
    "s13-heading": "13) Disclaimers",
    "s13-text": "<p>Except as expressly stated in these Terms, the Service (including AI features) is provided “as is” and “as available.” We do not promise that outputs will be accurate, complete, or suitable for any particular purpose. You should independently verify important information.</p>",
    "s14-heading": "14) Liability (UK wording)",
    "s14-text": "<p>Nothing in these Terms excludes or limits liability for death or personal injury caused by negligence, fraud or fraudulent misrepresentation, or any other liability that cannot be excluded or limited by law.</p><p><em>If you are a consumer:</em> We are not responsible for loss or damage that is not foreseeable, that you could have avoided by following our reasonable instructions, or that results from your misuse of the Service.</p><p><em>If you use the Service for business purposes:</em> We exclude all implied conditions, warranties, or representations to the maximum extent permitted by law; and our total aggregate liability in any 12-month period shall not exceed the higher of £100 or the fees you paid for the Service in that period.</p>",
    "s15-heading": "15) Indemnity (business users)",
    "s15-text": "<p>If you use the Service for or on behalf of a business, you agree to indemnify us against third-party claims arising from your unlawful use of the Service or your breach of these Terms.</p>",
    "s16-heading": "16) Changes to these Terms",
    "s16-text": "<p>We may update these Terms from time to time. For material changes, we will give at least 30 days’ notice before they take effect. If you do not agree, you may cancel before the effective date; continuing to use the Service after that date means you accept the changes.</p>",
    "s17-heading": "17) Governing law and jurisdiction",
    "s17-text": "<p>These Terms are governed by the laws of England and Wales. Courts in England and Wales have exclusive jurisdiction, except that consumers in Scotland or Northern Ireland may bring claims in their local courts.</p>",
    "s18-heading": "18) Miscellaneous",
    "s18-text": "<ul><li><strong>No waiver:</strong> If we delay enforcing these Terms, we can still enforce them later.</li><li><strong>Severability:</strong> If any part is unlawful or unenforceable, the rest remains in effect.</li><li><strong>Assignment:</strong> You may not assign or transfer your rights without our consent; we may assign in connection with a reorganisation or sale.</li><li><strong>Entire agreement:</strong> These Terms and our Privacy Policy are the entire agreement between you and us for the Service.</li><li><strong>Notices:</strong> We may provide notices by email or in-app.</li></ul>",
    "s19-heading": "19) Contact Brainstorm Buddy",
    "s19-text": "<p>Address: 167–169 Great Portland Street, 5th Floor, London, W1W 5PF, UK</p><p>Email: <a href=\\\"mailto:brainstormbuddyy@gmail.com\\\">brainstormbuddyy@gmail.com</a></p>",
    "footer-line": "&copy; 2025 Brainstorm Buddy. All rights reserved."
  },
  "es": {
    "title": "Términos del Servicio — Brainstorm Buddy",
    "dates-line": "Fecha de entrada en vigor: 20 de septiembre de 2025 &nbsp;•&nbsp; Última actualización: 20 de septiembre de 2025",
    "s1-heading": "1) Quiénes somos y cómo contactarnos",
    "s1-text": "<p>Brainstorm Buddy (el \"Servicio\") es proporcionado por Ibrahim Ahmed (\"nosotros\").</p><p>Dirección: 167–169 Great Portland Street, 5ª planta, Londres, W1W 5PF, Reino Unido</p><p>Correo: <a href=\\\"mailto:brainstormbuddyy@gmail.com\\\">brainstormbuddyy@gmail.com</a></p><p>Si tienes una pregunta o queja sobre privacidad, también puedes contactar con la Oficina del Comisionado de Información del Reino Unido (ICO) en <a href=\\\"https://ico.org.uk\\\" target=\\\"_blank\\\" rel=\\\"noopener\\\">ico.org.uk</a>.</p>",
    "s2-heading": "2) Qué hacen estos Términos",
    "s2-text": "<p>Estos Términos de Servicio (\"Términos\") regulan tu acceso y uso del Servicio (incluida nuestra extensión, sitio web y funciones relacionadas). Al usar el Servicio, aceptas estos Términos y nuestra Política de Privacidad (enlazada en el pie de nuestra web/app). Si usas el Servicio en nombre de una empresa, confirmas que estás autorizado para vincularla.</p>",
    "s3-heading": "3) Tu cuenta",
    "s3-text": "<p>Algunas funciones requieren una cuenta. Mantén seguras tus credenciales; eres responsable de la actividad en tu cuenta. Avísanos de inmediato si sospechas uso no autorizado.</p>",
    "s4-heading": "4) Contenido generado por IA (importante)",
    "s4-text": "<p>Brainstorm Buddy utiliza IA (incluidos servicios de OpenAI) para generar ideas y borradores de contenido. Los resultados de la IA pueden ser inexactos, incompletos o inapropiados y no constituyen asesoramiento profesional. Al usar funciones de IA, aceptas que:</p><ul><li>Eres responsable de cómo usas e interpretas los resultados (incluida la verificación de hechos y el cumplimiento de la ley).</li><li>Proporcionamos el Servicio \"tal cual\" para fines de creatividad y productividad y no garantizamos exactitud ni idoneidad para un propósito particular.</li></ul>",
    "s5-heading": "5) Uso aceptable",
    "s5-text": "<p>No debes usar el Servicio para:</p><ul><li>Violar la ley o los derechos de terceros (incluidos derechos de autor y marcas).</li><li>Producir o compartir contenido ilegal, engañoso, dañino o invasivo de la privacidad; malware; o contenido que facilite daños.</li><li>Presentar resultados de IA como hechos sin comprobaciones cuando la precisión sea importante.</li><li>Intentar eludir límites técnicos, sondear nuestros sistemas o crear varias cuentas para evadir límites.</li></ul><p>Podemos eliminar contenido, limitar el uso o suspender/terminar cuentas por infracciones o riesgos para la seguridad, la privacidad o la estabilidad del sistema.</p>",
    "s6-heading": "6) Planes, límites de uso y equidad",
    "s6-text": "<p><strong>Nombre del plan:</strong> Elite &nbsp;•&nbsp; <strong>Asignación mensual:</strong> hasta 700 generaciones de ideas con IA por mes por cuenta.</p><p>Podemos limitar temporalmente o suspender el acceso si superas materialmente las asignaciones o haces un uso indebido del Servicio. Está prohibido crear varias cuentas para eludir límites. Podemos publicar umbrales operativos actualizados de vez en cuando para proteger la salud del sistema.</p>",
    "s7-heading": "7) Precios, renovación automática, cancelaciones y reembolsos",
    "s7-text": "<ul><li><strong>Renovación automática.</strong> Las suscripciones (mensuales o anuales) se renuevan automáticamente hasta que las canceles en la web en la configuración de tu cuenta o contactándonos.</li><li><strong>Derecho de desistimiento para consumidores del Reino Unido.</strong> Si compras en línea como consumidor, tienes 14 días desde la compra para cancelar por cualquier motivo. Si pides que empecemos el servicio dentro de esos 14 días, reconoces que, una vez prestado completamente, pierdes el derecho de desistimiento, y podremos deducir un importe proporcional por los servicios ya prestados. Para cancelar dentro del período de desistimiento, usa el flujo en la app o escribe a <a href=\\\"mailto:brainstormbuddyy@gmail.com\\\">brainstormbuddyy@gmail.com</a>.</li><li><strong>Reembolsos.</strong> <em>Suscripciones mensuales:</em> Puedes cancelar en cualquier momento para detener renovaciones futuras. Las tarifas ya pagadas no son, por regla general, reembolsables, salvo cuando aplique el derecho de desistimiento de 14 días (sujeto a deducción proporcional si pediste iniciar de inmediato). <em>Suscripciones anuales:</em> Puedes cancelar dentro de los 14 días de la compra bajo las reglas de desistimiento (sujeto a deducción proporcional si pediste iniciar de inmediato). Pasados 14 días, las tarifas anuales no son reembolsables.</li><li><strong>Plazo de tramitación:</strong> Los reembolsos se procesan normalmente en 5 a 10 días hábiles al método de pago original.</li><li><strong>Abuso de reembolsos:</strong> Para prevenir abusos, podemos limitar compras futuras o rechazar solicitudes adicionales de reembolso si se han aprobado más de dos reembolsos para la misma cuenta o método de pago.</li><li>Te avisaremos antes de cualquier cambio de precio que afecte a tu próxima renovación.</li></ul>",
    "s8-heading": "8) Pagos y servicios de terceros",
    "s8-text": "<p>Los pagos son procesados por Stripe. También usamos servicios de Google (incluido Gmail) para comunicaciones y operaciones. Sus términos y políticas de privacidad se aplican a esos servicios. Consulta nuestra Política de Privacidad para detalles sobre intercambio de datos y salvaguardias.</p>",
    "s9-heading": "9) Privacidad y protección de datos",
    "s9-text": "<p>Somos el responsable del tratamiento de los datos personales procesados a través del Servicio. Tratamos datos para proporcionar, asegurar y mejorar el Servicio y para comunicarnos contigo. Puntos clave (consulta la Política de Privacidad para detalles completos):</p><ul><li>Las bases legales pueden incluir contrato, intereses legítimos y consentimiento (cuando corresponda).</li><li>Usamos proveedores (incluidos OpenAI, Stripe y Google) bajo contrato.</li><li>Parte del tratamiento puede ocurrir fuera del Reino Unido con salvaguardias adecuadas.</li><li>Tus derechos incluyen acceso, rectificación, supresión, limitación, portabilidad y oposición, y el derecho a reclamar ante la ICO.</li></ul>",
    "s10-heading": "10) Propiedad intelectual",
    "s10-text": "<p>El Servicio, incluido software, contenido y marca, es de nuestra propiedad o de nuestros licenciantes. Brainstorm Buddy es nuestra marca.</p><p><strong>Tus entradas y resultados de IA.</strong> Conservas los derechos sobre tu contenido de entrada. Para operar el Servicio, nos concedes una licencia mundial y gratuita para alojar, procesar y mostrar tus entradas y generar resultados bajo tu dirección. Sin perjuicio de derechos de terceros y de estos Términos, puedes usar los resultados para tus fines. Debes asegurarte de tener todos los derechos necesarios sobre tus entradas.</p>",
    "s11-heading": "11) Cambios y disponibilidad del servicio",
    "s11-text": "<p>Podemos actualizar o cambiar funciones para mejorar el rendimiento o atender requisitos de seguridad/legales. Si realizamos cambios materiales que te afecten negativamente, daremos al menos 30 días de aviso (por email o en la app) cuando sea razonable, y podrás cancelar antes de que el cambio entre en vigor. Aspiramos a alta disponibilidad pero no garantizamos un servicio ininterrumpido o libre de errores. Anunciaremos mantenimientos programados cuando sea posible.</p>",
    "s12-heading": "12) Suspensión y terminación",
    "s12-text": "<p>Podemos suspender o terminar tu acceso si incumples material o repetidamente estos Términos o la ley; si tu uso supone un riesgo de seguridad o estabilidad; o si lo exige la ley o un proveedor. Intentaremos avisar razonablemente cuando corresponda. Al terminar, tu derecho a usar el Servicio cesa, pero las cláusulas que deban sobrevivir (p. ej., PI, límites de responsabilidad, reembolsos ya procesados) continuarán. Consulta nuestra Política de Privacidad para retención y eliminación.</p>",
    "s13-heading": "13) Descargos de responsabilidad",
    "s13-text": "<p>Salvo lo establecido expresamente en estos Términos, el Servicio (incluyendo funciones de IA) se ofrece \"tal cual\" y \"según disponibilidad\". No prometemos que los resultados sean exactos, completos o adecuados para un propósito particular. Debes verificar de forma independiente la información importante.</p>",
    "s14-heading": "14) Responsabilidad (redacción del Reino Unido)",
    "s14-text": "<p>Nada en estos Términos excluye o limita la responsabilidad por muerte o lesiones personales causadas por negligencia, fraude o tergiversación fraudulenta, o cualquier otra responsabilidad que no pueda excluirse o limitarse por ley.</p><p><em>Si eres consumidor:</em> No somos responsables de pérdidas o daños que no sean previsibles, que pudiste evitar siguiendo nuestras instrucciones razonables o que resulten de tu uso indebido del Servicio.</p><p><em>Si usas el Servicio con fines empresariales:</em> Excluimos todas las condiciones, garantías o declaraciones implícitas en la máxima medida permitida por la ley; y nuestra responsabilidad total agregada en cualquier período de 12 meses no excederá el mayor de £100 o las tarifas que pagaste por el Servicio en ese período.</p>",
    "s15-heading": "15) Indemnización (usuarios empresariales)",
    "s15-text": "<p>Si usas el Servicio para o en nombre de una empresa, aceptas indemnizarnos frente a reclamaciones de terceros derivadas de tu uso ilícito del Servicio o de tu incumplimiento de estos Términos.</p>",
    "s16-heading": "16) Cambios a estos Términos",
    "s16-text": "<p>Podemos actualizar estos Términos periódicamente. Para cambios materiales, daremos al menos 30 días de aviso antes de que surtan efecto. Si no estás de acuerdo, puedes cancelar antes de la fecha de efecto; continuar usando el Servicio después de esa fecha implica que aceptas los cambios.</p>",
    "s17-heading": "17) Ley aplicable y jurisdicción",
    "s17-text": "<p>Estos Términos se rigen por las leyes de Inglaterra y Gales. Los tribunales de Inglaterra y Gales tienen jurisdicción exclusiva, salvo que los consumidores en Escocia o Irlanda del Norte puedan presentar reclamaciones en sus tribunales locales.</p>",
    "s18-heading": "18) Miscelánea",
    "s18-text": "<ul><li><strong>No renuncia:</strong> Si demoramos en hacer cumplir estos Términos, podremos hacerlo más tarde.</li><li><strong>Divisibilidad:</strong> Si alguna parte es ilegal o inaplicable, el resto permanece en vigor.</li><li><strong>Cesión:</strong> No puedes ceder o transferir tus derechos sin nuestro consentimiento; podemos cederlos en relación con una reorganización o venta.</li><li><strong>Acuerdo íntegro:</strong> Estos Términos y nuestra Política de Privacidad constituyen el acuerdo íntegro entre tú y nosotros para el Servicio.</li><li><strong>Avisos:</strong> Podemos enviar avisos por correo electrónico o en la app.</li></ul>",
    "s19-heading": "19) Contactar con Brainstorm Buddy",
    "s19-text": "<p>Dirección: 167–169 Great Portland Street, 5ª planta, Londres, W1W 5PF, Reino Unido</p><p>Correo: <a href=\\\"mailto:brainstormbuddyy@gmail.com\\\">brainstormbuddyy@gmail.com</a></p>",
    "footer-line": "&copy; 2025 Brainstorm Buddy. Todos los derechos reservados."
  },
  "fr": {
    "title": "Conditions d’utilisation — Brainstorm Buddy",
    "dates-line": "Date d’effet : 20 septembre 2025 &nbsp;•&nbsp; Dernière mise à jour : 20 septembre 2025",
    "s1-heading": "1) Qui nous sommes et comment nous contacter",
    "s1-text": "<p>Brainstorm Buddy (le « Service ») est fourni par Ibrahim Ahmed (« nous », « notre »).</p><p>Adresse : 167–169 Great Portland Street, 5e étage, Londres, W1W 5PF, Royaume-Uni</p><p>Email : <a href=\\\"mailto:brainstormbuddyy@gmail.com\\\">brainstormbuddyy@gmail.com</a></p><p>Pour toute question ou plainte relative à la confidentialité, vous pouvez également contacter l’ICO (Information Commissioner’s Office) au Royaume-Uni sur <a href=\\\"https://ico.org.uk\\\" target=\\\"_blank\\\" rel=\\\"noopener\\\">ico.org.uk</a>.</p>",
    "s2-heading": "2) Objet des présentes Conditions",
    "s2-text": "<p>Ces Conditions d’utilisation (« Conditions ») régissent votre accès au Service et son utilisation (y compris notre extension, notre site et les fonctionnalités associées). En utilisant le Service, vous acceptez ces Conditions ainsi que notre Politique de confidentialité (lien en pied de page de notre site/app). Si vous utilisez le Service pour le compte d’une entreprise, vous confirmez être autorisé à l’engager.</p>",
    "s3-heading": "3) Votre compte",
    "s3-text": "<p>Certaines fonctionnalités exigent un compte. Protégez vos identifiants ; vous êtes responsable de l’activité de votre compte. Informez-nous rapidement en cas d’utilisation non autorisée présumée.</p>",
    "s4-heading": "4) Contenu généré par l’IA (important)",
    "s4-text": "<p>Brainstorm Buddy utilise l’IA (y compris des services d’OpenAI) pour générer des idées et des brouillons. Les résultats d’IA peuvent être inexacts, incomplets ou inappropriés et ne constituent pas un conseil professionnel. En utilisant ces fonctionnalités, vous acceptez que :</p><ul><li>Vous êtes responsable de l’usage et de l’interprétation des résultats (y compris la vérification des faits et le respect de la loi).</li><li>Nous fournissons le Service « en l’état » pour la créativité et la productivité et ne garantissons ni l’exactitude ni l’adéquation à un but particulier.</li></ul>",
    "s5-heading": "5) Utilisation acceptable",
    "s5-text": "<p>Vous ne devez pas utiliser le Service pour :</p><ul><li>Enfreindre la loi ou les droits d’autrui (y compris droits d’auteur et marques).</li><li>Produire ou partager un contenu illégal, trompeur, nuisible ou intrusif pour la vie privée ; des malwares ; ou un contenu facilitant un préjudice.</li><li>Présenter des résultats d’IA comme factuels sans vérifications lorsque la précision est essentielle.</li><li>Tenter de contourner des limites techniques, sonder nos systèmes ou créer plusieurs comptes pour les contourner.</li></ul><p>Nous pouvons supprimer du contenu, limiter l’usage ou suspendre/fermer des comptes en cas de violation ou de risques pour la sécurité, la vie privée ou la stabilité du système.</p>",
    "s6-heading": "6) Forfaits, limites d’usage et équité",
    "s6-text": "<p><strong>Nom du forfait :</strong> Elite &nbsp;•&nbsp; <strong>Quota mensuel :</strong> jusqu’à 700 générations d’idées IA par mois et par compte.</p><p>Nous pouvons limiter temporairement ou suspendre l’accès si vous dépassez substantiellement les quotas ou faites un usage abusif du Service. La création de comptes multiples pour contourner les limites est interdite. Nous pouvons publier des seuils opérationnels mis à jour afin de protéger la santé du système.</p>",
    "s7-heading": "7) Prix, renouvellement automatique, annulations et remboursements",
    "s7-text": "<ul><li><strong>Renouvellement automatique.</strong> Les abonnements (mensuels ou annuels) se renouvellent automatiquement jusqu’à résiliation via les réglages de compte sur le site ou en nous contactant.</li><li><strong>Droit de rétractation pour les consommateurs britanniques.</strong> Si vous achetez en ligne en tant que consommateur, vous disposez de 14 jours à compter de l’achat pour vous rétracter. Si vous nous demandez de démarrer le service durant cette période, vous reconnaissez qu’une fois le service entièrement exécuté vous perdez ce droit, et nous pouvons déduire un montant proportionnel pour les services déjà fournis. Pour vous rétracter, utilisez le flux in-app ou écrivez à <a href=\\\"mailto:brainstormbuddyy@gmail.com\\\">brainstormbuddyy@gmail.com</a>.</li><li><strong>Remboursements.</strong> <em>Mensuel :</em> vous pouvez annuler à tout moment pour éviter les renouvellements futurs. Les frais déjà payés ne sont généralement pas remboursables, sauf application du droit de rétractation de 14 jours (avec éventuelle déduction proportionnelle si vous avez demandé un démarrage immédiat). <em>Annuel :</em> vous pouvez annuler dans les 14 jours suivant l’achat au titre de la rétractation (avec éventuelle déduction proportionnelle si démarrage immédiat). Après 14 jours, les frais annuels ne sont pas remboursables.</li><li><strong>Délai de traitement :</strong> généralement 5 à 10 jours ouvrés vers le moyen de paiement d’origine.</li><li><strong>Abus de remboursements :</strong> Pour prévenir les abus, nous pouvons limiter les achats futurs ou refuser d’autres demandes si plus de deux remboursements ont été approuvés pour le même compte ou moyen de paiement.</li><li>Nous vous informerons avant tout changement de prix affectant votre prochain renouvellement.</li></ul>",
    "s8-heading": "8) Paiements et services tiers",
    "s8-text": "<p>Les paiements sont traités par Stripe. Nous utilisons également des services de Google (y compris Gmail) pour les communications et l’exploitation. Leurs conditions et politiques de confidentialité s’appliquent à leurs services. Voir notre Politique de confidentialité pour les détails sur le partage des données et les garanties.</p>",
    "s9-heading": "9) Confidentialité et protection des données",
    "s9-text": "<p>Nous sommes le responsable du traitement des données personnelles traitées via le Service. Nous traitons des données pour fournir, sécuriser et améliorer le Service et pour communiquer avec vous. Points clés (voir notre Politique de confidentialité pour plus de détails) :</p><ul><li>Bases légales : contrat, intérêts légitimes et consentement (le cas échéant).</li><li>Prestataires (dont OpenAI, Stripe et Google) sous contrat.</li><li>Certains traitements peuvent avoir lieu hors du Royaume-Uni avec des garanties appropriées.</li><li>Vos droits incluent l’accès, la rectification, l’effacement, la limitation, la portabilité, l’opposition et le droit de réclamation auprès de l’ICO.</li></ul>",
    "s10-heading": "10) Propriété intellectuelle",
    "s10-text": "<p>Le Service, y compris le logiciel, le contenu et l’image de marque, est notre propriété ou celle de nos concédants. Brainstorm Buddy est notre marque.</p><p><strong>Vos contenus d’entrée et résultats d’IA.</strong> Vous conservez les droits sur vos contenus d’entrée. Pour faire fonctionner le Service, vous nous concédez une licence mondiale et gratuite pour héberger, traiter et afficher vos contenus d’entrée et générer des résultats à votre demande. Sous réserve des droits de tiers et des présentes Conditions, vous pouvez utiliser les résultats pour vos propres besoins. Vous devez disposer de tous les droits nécessaires sur vos contenus d’entrée.</p>",
    "s11-heading": "11) Évolutions du Service et disponibilité",
    "s11-text": "<p>Nous pouvons mettre à jour ou modifier des fonctionnalités pour améliorer les performances ou répondre à des exigences de sécurité/légal. En cas de modifications importantes ayant un impact négatif, nous fournirons un préavis d’au moins 30 jours (par email ou in-app) lorsque cela est raisonnable, et vous pourrez résilier avant l’entrée en vigueur. Nous visons une haute disponibilité sans la garantir. Les maintenances planifiées seront annoncées lorsque possible.</p>",
    "s12-heading": "12) Suspension et résiliation",
    "s12-text": "<p>Nous pouvons suspendre ou résilier votre accès en cas de violation substantielle ou répétée des présentes ou de la loi ; si votre usage présente un risque pour la sécurité ou la stabilité ; ou si la loi ou un fournisseur l’exige. Nous tenterons d’en avertir raisonnablement le cas échéant. À la résiliation, votre droit d’utiliser le Service cesse, mais les clauses qui doivent survivre (p. ex., PI, limites de responsabilité, remboursements déjà traités) subsistent. Voir notre Politique de confidentialité pour la conservation et la suppression.</p>",
    "s13-heading": "13) Avertissements",
    "s13-text": "<p>Sauf mention contraire dans les présentes, le Service (y compris les fonctionnalités d’IA) est fourni « en l’état » et « selon disponibilité ». Nous ne garantissons pas que les résultats seront exacts, complets ou adaptés à un objectif particulier. Vous devez vérifier de manière indépendante les informations importantes.</p>",
    "s14-heading": "14) Responsabilité (rédaction Royaume-Uni)",
    "s14-text": "<p>Aucune disposition des présentes n’exclut ni ne limite la responsabilité en cas de décès ou de dommages corporels dus à une négligence, de fraude ou de déclaration frauduleuse, ni toute autre responsabilité qui ne peut être exclue ou limitée par la loi.</p><p><em>Consommateurs :</em> Nous ne sommes pas responsables des pertes ou dommages imprévisibles, que vous auriez pu éviter en suivant nos instructions raisonnables, ou résultant d’un usage inapproprié du Service.</p><p><em>Usages professionnels :</em> Nous excluons toute condition, garantie ou déclaration implicite dans la mesure permise par la loi ; et notre responsabilité totale agrégée sur toute période de 12 mois n’excédera pas le plus élevé entre 100 £ ou les frais que vous avez payés pour le Service durant cette période.</p>",
    "s15-heading": "15) Indemnisation (utilisateurs professionnels)",
    "s15-text": "<p>Si vous utilisez le Service pour ou au nom d’une entreprise, vous acceptez de nous indemniser contre les réclamations de tiers résultant de votre utilisation illicite du Service ou de votre violation des présentes Conditions.</p>",
    "s16-heading": "16) Modifications des présentes",
    "s16-text": "<p>Nous pouvons mettre à jour ces Conditions de temps à autre. Pour les modifications importantes, nous fournirons un préavis d’au moins 30 jours avant leur prise d’effet. Si vous n’êtes pas d’accord, vous pouvez résilier avant la date d’effet ; l’usage continu du Service après cette date vaut acceptation.</p>",
    "s17-heading": "17) Droit applicable et juridiction",
    "s17-text": "<p>Les présentes sont régies par le droit d’Angleterre et du Pays de Galles. Les tribunaux d’Angleterre et du Pays de Galles sont seuls compétents, sous réserve que les consommateurs d’Écosse ou d’Irlande du Nord puissent agir devant leurs tribunaux locaux.</p>",
    "s18-heading": "18) Divers",
    "s18-text": "<ul><li><strong>Absence de renonciation :</strong> Un retard d’exécution n’emporte pas renonciation.</li><li><strong>Divisibilité :</strong> Si une clause est illégale ou inapplicable, le reste demeure en vigueur.</li><li><strong>Cession :</strong> Vous ne pouvez pas céder vos droits sans notre accord ; nous pouvons céder dans le cadre d’une réorganisation ou d’une cession.</li><li><strong>Accord intégral :</strong> Les présentes et notre Politique de confidentialité constituent l’intégralité de l’accord entre vous et nous concernant le Service.</li><li><strong>Notifications :</strong> Nous pouvons vous notifier par email ou via l’app.</li></ul>",
    "s19-heading": "19) Contacter Brainstorm Buddy",
    "s19-text": "<p>Adresse : 167–169 Great Portland Street, 5e étage, Londres, W1W 5PF, Royaume-Uni</p><p>Email : <a href=\\\"mailto:brainstormbuddyy@gmail.com\\\">brainstormbuddyy@gmail.com</a></p>",
    "footer-line": "&copy; 2025 Brainstorm Buddy. Tous droits réservés."
  },
  "ru": {
    "title": "Условия обслуживания — Brainstorm Buddy",
    "dates-line": "Дата вступления в силу: 20 сентября 2025&nbsp;г. &nbsp;•&nbsp; Последнее обновление: 20 сентября 2025&nbsp;г.",
    "s1-heading": "1) Кто мы и как с нами связаться",
    "s1-text": "<p>Brainstorm Buddy («Сервис») предоставляется Ибрагимом Ахмедом («мы», «нас», «наш»).</p><p>Адрес: 167–169 Great Portland Street, 5th Floor, London, W1W 5PF, UK</p><p>Email: <a href=\\\"mailto:brainstormbuddyy@gmail.com\\\">brainstormbuddyy@gmail.com</a></p><p>По вопросам конфиденциальности вы также можете обратиться в Управление уполномоченного по информации Великобритании (ICO): <a href=\\\"https://ico.org.uk\\\" target=\\\"_blank\\\" rel=\\\"noopener\\\">ico.org.uk</a>.</p>",
    "s2-heading": "2) Что регулируют эти Условия",
    "s2-text": "<p>Настоящие Условия обслуживания («Условия») регулируют ваш доступ к Сервису и его использование (включая наше расширение, веб-сайт и сопутствующие функции). Используя Сервис, вы соглашаетесь с этими Условиями и с нашей Политикой конфиденциальности (ссылка в подвале сайта/приложения). Если вы пользуетесь Сервисом от имени бизнеса, вы подтверждаете, что уполномочены связывать этот бизнес обязательствами.</p>",
    "s3-heading": "3) Ваша учетная запись",
    "s3-text": "<p>Некоторые функции требуют учетной записи. Храните свои учетные данные в безопасности; вы несете ответственность за действия в вашей учетной записи. Сообщите нам незамедлительно при подозрении на несанкционированное использование.</p>",
    "s4-heading": "4) Контент, созданный ИИ (важно)",
    "s4-text": "<p>Brainstorm Buddy использует ИИ (включая сервисы OpenAI) для генерации идей и чернового контента. Результаты ИИ могут быть неточными, неполными или неуместными и не являются профессиональной консультацией. Используя функции ИИ, вы соглашаетесь, что:</p><ul><li>Вы несете ответственность за использование и интерпретацию результатов (включая проверку фактов и соблюдение закона).</li><li>Мы предоставляем Сервис «как есть» для целей творчества и продуктивности и не гарантируем точность или пригодность для конкретной цели.</li></ul>",
    "s5-heading": "5) Допустимое использование",
    "s5-text": "<p>Вам запрещено использовать Сервис для:</p><ul><li>Нарушения закона или прав других лиц (включая авторские права и товарные знаки).</li><li>Создания или распространения незаконного, вводящего в заблуждение, вредоносного или нарушающего приватность контента; вредоносного ПО; либо контента, способствующего причинению вреда.</li><li>Выдачи результатов ИИ за факты без проверок там, где важна точность.</li><li>Обхода технических ограничений, зондирования наших систем или создания нескольких аккаунтов для обхода лимитов.</li></ul><p>Мы можем удалять контент, ограничивать использование или приостанавливать/прекращать учетные записи при нарушениях либо рисках для безопасности, конфиденциальности или стабильности системы.</p>",
    "s6-heading": "6) Тарифы, лимиты и добросовестность",
    "s6-text": "<p><strong>Название тарифа:</strong> Elite &nbsp;•&nbsp; <strong>Месячный лимит:</strong> до 700 генераций идей ИИ в месяц на аккаунт.</p><p>Мы можем временно ограничить или приостановить доступ, если вы существенно превышаете лимиты или злоупотребляете Сервисом. Запрещено создавать несколько аккаунтов для обхода ограничений. В интересах стабильности мы можем время от времени публиковать обновленные операционные пороги.</p>",
    "s7-heading": "7) Цены, авто-продление, отмены и возвраты",
    "s7-text": "<ul><li><strong>Авто-продление.</strong> Подписки (месячные или годовые) продлеваются автоматически, пока вы не отмените их на сайте в настройках аккаунта или связавшись с нами.</li><li><strong>Период охлаждения для потребителей Великобритании.</strong> Если вы покупаете онлайн как потребитель, у вас есть 14 дней с момента покупки для отмены по любой причине. Если вы просите начать оказание услуги в этот период, вы признаете, что после полной реализации услуги право на отмену утрачивается, а мы можем удержать пропорциональную сумму за уже оказанные услуги. Для отмены в период охлаждения используйте процесс в приложении или пишите на <a href=\\\"mailto:brainstormbuddyy@gmail.com\\\">brainstormbuddyy@gmail.com</a>.</li><li><strong>Возвраты.</strong> <em>Месячные подписки:</em> вы можете отменить в любое время, чтобы остановить будущие продления. Уже уплаченные суммы, как правило, не возвращаются, за исключением права на 14-дневный отказ (с возможным пропорциональным удержанием при немедленном запуске). <em>Годовые подписки:</em> можете отменить в течение 14 дней по правилам отказа (с возможным пропорциональным удержанием при немедленном запуске). По истечении 14 дней годовые платежи не возвращаются.</li><li><strong>Срок обработки:</strong> обычно 5–10 рабочих дней на исходный способ оплаты.</li><li><strong>Злоупотребление возвратами:</strong> Чтобы предотвратить злоупотребления, мы можем ограничить будущие покупки или отклонять дальнейшие запросы на возврат, если по одному аккаунту или способу оплаты было одобрено более двух возвратов.</li><li>Мы уведомим вас перед изменением цены, которое затронет следующего продление.</li></ul>",
    "s8-heading": "8) Платежи и сторонние сервисы",
    "s8-text": "<p>Платежи обрабатываются Stripe. Мы также используем сервисы Google (включая Gmail) для коммуникаций и операций. Их условия и политики конфиденциальности применяются к их услугам. Подробности об обмене данными и мерах защиты — в нашей Политике конфиденциальности.</p>",
    "s9-heading": "9) Конфиденциальность и защита данных",
    "s9-text": "<p>Мы являемся контролером персональных данных, обрабатываемых через Сервис. Мы обрабатываем данные для предоставления, защиты и улучшения Сервиса и для связи с вами. Основные положения (подробности — в Политике конфиденциальности):</p><ul><li>Правовые основания могут включать договор, законные интересы и согласие (если применимо).</li><li>Мы используем провайдеров (включая OpenAI, Stripe и Google) на договорной основе.</li><li>Часть обработки может происходить за пределами Великобритании при наличии соответствующих гарантий.</li><li>Ваши права включают доступ, исправление, удаление, ограничение, переносимость и возражение, а также право жалобы в ICO.</li></ul>",
    "s10-heading": "10) Интеллектуальная собственность",
    "s10-text": "<p>Сервис, включая программное обеспечение, контент и брендинг, принадлежит нам или нашим лицензиарам. Brainstorm Buddy — наша товарная марка.</p><p><strong>Ваши входные данные и результаты ИИ.</strong> Вы сохраняете права на свой входной контент. Для работы Сервиса вы предоставляете нам всемирную бесплатную лицензию на размещение, обработку и отображение ваших входных данных и генерацию результатов по вашему указанию. С учетом прав третьих лиц и настоящих Условий вы можете использовать результаты для своих целей. Вы должны обеспечить наличие всех необходимых прав на свои входные данные.</p>",
    "s11-heading": "11) Изменения сервиса и доступность",
    "s11-text": "<p>Мы можем обновлять или изменять функции для улучшения производительности или выполнения требований безопасности/закона. Если мы вносим существенные изменения, негативно влияющие на вас, мы, по возможности, предоставим уведомление минимум за 30 дней (по email или в приложении), и вы можете отменить подписку до вступления изменений в силу. Мы стремимся к высокой доступности, но не гарантируем бесперебойную или безошибочную работу. О плановом обслуживании будем сообщать, когда это возможно.</p>",
    "s12-heading": "12) Приостановление и прекращение",
    "s12-text": "<p>Мы можем приостановить или прекратить доступ, если вы существенно или неоднократно нарушаете настоящие Условия или закон; если ваше использование создает риск для безопасности или стабильности; либо если этого требует закон или провайдер. Мы постараемся заблаговременно уведомить, когда это уместно. После прекращения ваше право использовать Сервис прекращается, но положения, которые разумно должны сохранять силу (например, ИС, ограничения ответственности, уже обработанные возвраты), продолжают действовать. См. нашу Политику конфиденциальности относительно хранения и удаления.</p>",
    "s13-heading": "13) Отказ от гарантий",
    "s13-text": "<p>За исключением прямо указанных случаев, Сервис (включая функции ИИ) предоставляется «как есть» и «как доступно». Мы не обещаем, что результаты будут точными, полными или подходящими для конкретной цели. Важную информацию следует проверять независимо.</p>",
    "s14-heading": "14) Ответственность (формулировки Великобритании)",
    "s14-text": "<p>Ничто в настоящих Условиях не исключает и не ограничивает ответственность за смерть или телесные повреждения по причине небрежности, мошенничество или мошенническое введение в заблуждение, а также любую иную ответственность, которую нельзя исключить или ограничить по закону.</p><p><em>Если вы потребитель:</em> Мы не отвечаем за убытки или ущерб, которые не являются предсказуемыми, которых вы могли избежать, следуя нашим разумным инструкциям, или которые возникли из-за неправильного использования Сервиса.</p><p><em>Если вы используете Сервис в деловых целях:</em> Мы исключаем все подразумеваемые условия, гарантии и заверения в максимально допустимой законом мере; совокупная ответственность за любой 12-месячный период не превышает большего из значений: £100 либо уплаченные вами за Сервис сборы за этот период.</p>",
    "s15-heading": "15) Возмещение убытков (для бизнес-пользователей)",
    "s15-text": "<p>Если вы используете Сервис для бизнеса или от его имени, вы соглашаетесь возместить нам убытки по требованиям третьих лиц, возникающим из вашего незаконного использования Сервиса или нарушения настоящих Условий.</p>",
    "s16-heading": "16) Изменения настоящих Условий",
    "s16-text": "<p>Мы можем время от времени обновлять эти Условия. В случае существенных изменений мы предоставим уведомление как минимум за 30 дней до вступления их в силу. Если вы не согласны, вы можете отменить до даты вступления; продолжение использования после этой даты означает ваше согласие.</p>",
    "s17-heading": "17) Применимое право и юрисдикция",
    "s17-text": "<p>Настоящие Условия регулируются правом Англии и Уэльса. Суды Англии и Уэльса обладают исключительной юрисдикцией, за исключением случаев, когда потребители в Шотландии или Северной Ирландии могут предъявлять иски в своих местных судах.</p>",
    "s18-heading": "18) Прочие положения",
    "s18-text": "<ul><li><strong>Отсутствие отказа от прав:</strong> Задержка в применении Условий не лишает нас права применить их позднее.</li><li><strong>Делимость:</strong> Если какая-либо часть незаконна или неисполнима, остальная часть остается в силе.</li><li><strong>Уступка:</strong> Вы не можете уступать права без нашего согласия; мы можем уступать в связи с реорганизацией или продажей.</li><li><strong>Полное соглашение:</strong> Настоящие Условия и наша Политика конфиденциальности составляют полное соглашение между вами и нами относительно Сервиса.</li><li><strong>Уведомления:</strong> Мы можем направлять уведомления по email или через приложение.</li></ul>",
    "s19-heading": "19) Контакты Brainstorm Buddy",
    "s19-text": "<p>Адрес: 167–169 Great Portland Street, 5th Floor, London, W1W 5PF, UK</p><p>Email: <a href=\\\"mailto:brainstormbuddyy@gmail.com\\\">brainstormbuddyy@gmail.com</a></p>",
    "footer-line": "&copy; 2025 Brainstorm Buddy. Все права защищены."
  },
  "it": {
    "title": "Termini di Servizio — Brainstorm Buddy",
    "dates-line": "Data di efficacia: 20 settembre 2025 &nbsp;•&nbsp; Ultimo aggiornamento: 20 settembre 2025",
    "s1-heading": "1) Chi siamo e come contattarci",
    "s1-text": "<p>Brainstorm Buddy (il \"Servizio\") è fornito da Ibrahim Ahmed (\"noi\").</p><p>Indirizzo: 167–169 Great Portland Street, 5° piano, Londra, W1W 5PF, Regno Unito</p><p>Email: <a href=\\\"mailto:brainstormbuddyy@gmail.com\\\">brainstormbuddyy@gmail.com</a></p><p>Per domande o reclami sulla privacy, puoi anche contattare l’Information Commissioner’s Office (ICO) del Regno Unito su <a href=\\\"https://ico.org.uk\\\" target=\\\"_blank\\\" rel=\\\"noopener\\\">ico.org.uk</a>.</p>",
    "s2-heading": "2) Cosa prevedono questi Termini",
    "s2-text": "<p>Questi Termini di Servizio (\"Termini\") regolano il tuo accesso e uso del Servizio (inclusa la nostra estensione, il sito web e le funzionalità correlate). Usando il Servizio accetti questi Termini e la nostra Informativa sulla Privacy (link nel footer del sito/app). Se utilizzi il Servizio per conto di un’azienda, confermi di essere autorizzato a vincolarla.</p>",
    "s3-heading": "3) Il tuo account",
    "s3-text": "<p>Alcune funzionalità richiedono un account. Tieni al sicuro le tue credenziali; sei responsabile dell’attività sul tuo account. Informaci tempestivamente se sospetti un uso non autorizzato.</p>",
    "s4-heading": "4) Contenuti generati dall’IA (importante)",
    "s4-text": "<p>Brainstorm Buddy utilizza l’IA (inclusi i servizi di OpenAI) per generare idee e bozze di contenuti. I risultati dell’IA possono essere inaccurati, incompleti o inappropriati e non costituiscono consulenza professionale. Utilizzando le funzionalità IA accetti che:</p><ul><li>Sei responsabile di come utilizzi e interpreti i risultati (inclusa la verifica dei fatti e il rispetto della legge).</li><li>Forniamo il Servizio \"così com’è\" per finalità di creatività e produttività e non garantiamo accuratezza o idoneità a uno scopo particolare.</li></ul>",
    "s5-heading": "5) Uso accettabile",
    "s5-text": "<p>Non devi utilizzare il Servizio per:</p><ul><li>Violazioni di legge o dei diritti altrui (inclusi copyright e marchi).</li><li>Produrre o condividere contenuti illegali, ingannevoli, dannosi o invasivi della privacy; malware; o contenuti che facilitino danni.</li><li>Presentare risultati IA come fatti senza verifiche quando la precisione è fondamentale.</li><li>Tentare di aggirare limiti tecnici, sondare i nostri sistemi o creare più account per eludere i limiti.</li></ul><p>Possiamo rimuovere contenuti, limitare l’uso o sospendere/chiudere account in caso di violazioni o rischi per sicurezza, privacy o stabilità del sistema.</p>",
    "s6-heading": "6) Piani, limiti di utilizzo ed equità",
    "s6-text": "<p><strong>Nome del piano:</strong> Elite &nbsp;•&nbsp; <strong>Quota mensile:</strong> fino a 700 generazioni di idee IA al mese per account.</p><p>Possiamo limitare temporaneamente o sospendere l’accesso se superi in modo sostanziale le quote o fai un uso improprio del Servizio. È vietato creare più account per aggirare i limiti. Possiamo pubblicare soglie operative aggiornate per proteggere la salute del sistema.</p>",
    "s7-heading": "7) Prezzi, rinnovo automatico, cancellazioni e rimborsi",
    "s7-text": "<ul><li><strong>Rinnovo automatico.</strong> Gli abbonamenti (mensili o annuali) si rinnovano automaticamente finché non li annulli dal sito nelle impostazioni dell’account o contattandoci.</li><li><strong>Diritto di recesso per i consumatori nel Regno Unito.</strong> Se acquisti online come consumatore, hai 14 giorni dall’acquisto per annullare per qualsiasi motivo. Se ci chiedi di avviare il servizio entro tale periodo, riconosci che, una volta completato il servizio, perdi il diritto di recesso e potremmo detrarre un importo proporzionato per i servizi già forniti. Per recedere entro 14 giorni, usa il flusso in-app o scrivi a <a href=\\\"mailto:brainstormbuddyy@gmail.com\\\">brainstormbuddyy@gmail.com</a>.</li><li><strong>Rimborsi.</strong> <em>Abbonamenti mensili:</em> puoi annullare in qualsiasi momento per interrompere i rinnovi futuri. Le somme già pagate in genere non sono rimborsabili, salvo applicazione del diritto di recesso di 14 giorni (con eventuale detrazione proporzionale se hai chiesto l’avvio immediato). <em>Abbonamenti annuali:</em> puoi annullare entro 14 giorni dall’acquisto secondo le regole di recesso (con eventuale detrazione proporzionale se avvio immediato). Dopo 14 giorni, le tariffe annuali non sono rimborsabili.</li><li><strong>Tempi di lavorazione:</strong> i rimborsi vengono in genere elaborati in 5–10 giorni lavorativi sul metodo di pagamento originale.</li><li><strong>Abuso di rimborsi:</strong> Per prevenire abusi, potremmo limitare acquisti futuri o rifiutare ulteriori richieste se sono stati approvati più di due rimborsi per lo stesso account o metodo di pagamento.</li><li>Ti avviseremo prima di qualsiasi variazione di prezzo che abbia effetto sul prossimo rinnovo.</li></ul>",
    "s8-heading": "8) Pagamenti e servizi di terze parti",
    "s8-text": "<p>I pagamenti sono elaborati da Stripe. Utilizziamo anche servizi di Google (incluso Gmail) per comunicazioni e operazioni. I loro termini e le loro politiche sulla privacy si applicano ai rispettivi servizi. Vedi la nostra Informativa sulla Privacy per i dettagli su condivisione dei dati e tutele.</p>",
    "s9-heading": "9) Privacy e protezione dei dati",
    "s9-text": "<p>Siamo il titolare del trattamento dei dati personali trattati tramite il Servizio. Trattiamo dati per fornire, proteggere e migliorare il Servizio e per comunicare con te. Punti chiave (vedi l’Informativa sulla Privacy per i dettagli completi):</p><ul><li>Basi giuridiche: contratto, legittimo interesse e consenso (se applicabile).</li><li>Utilizziamo fornitori (inclusi OpenAI, Stripe e Google) in base a contratto.</li><li>Alcuni trattamenti possono avvenire al di fuori del Regno Unito con adeguate garanzie.</li><li>I tuoi diritti includono accesso, rettifica, cancellazione, limitazione, portabilità e opposizione, nonché il diritto di reclamo all’ICO.</li></ul>",
    "s10-heading": "10) Proprietà intellettuale",
    "s10-text": "<p>Il Servizio, incluso software, contenuti e branding, è di nostra proprietà o dei nostri licenzianti. Brainstorm Buddy è il nostro marchio.</p><p><strong>I tuoi input e i risultati dell’IA.</strong> Conservi i diritti sui tuoi contenuti di input. Per operare il Servizio, ci concedi una licenza mondiale e gratuita per ospitare, trattare e mostrare i tuoi input e generare risultati secondo le tue istruzioni. Fatti salvi i diritti di terzi e questi Termini, puoi utilizzare i risultati per i tuoi scopi. Devi assicurarti di disporre di tutti i diritti necessari sui tuoi input.</p>",
    "s11-heading": "11) Modifiche al servizio e disponibilità",
    "s11-text": "<p>Possiamo aggiornare o modificare funzionalità per migliorare le prestazioni o soddisfare requisiti di sicurezza/legali. Se apportiamo modifiche sostanziali che ti impattano negativamente, forniremo un preavviso di almeno 30 giorni (via email o in-app) quando ragionevole, e potrai annullare prima dell’efficacia. Miriamo ad alta disponibilità ma non garantiamo un servizio ininterrotto o privo di errori. La manutenzione programmata sarà annunciata quando possibile.</p>",
    "s12-heading": "12) Sospensione e cessazione",
    "s12-text": "<p>Possiamo sospendere o terminare il tuo accesso se violi in modo sostanziale o ripetuto questi Termini o la legge; se il tuo uso comporta rischi per sicurezza o stabilità; o se richiesto dalla legge o da un fornitore. Cercheremo di fornire un preavviso ragionevole quando appropriato. Alla cessazione, il tuo diritto d’uso termina, ma le clausole che ragionevolmente devono sopravvivere (es. PI, limiti di responsabilità, rimborsi già elaborati) continueranno. Vedi l’Informativa sulla Privacy per conservazione ed eliminazione.</p>",
    "s13-heading": "13) Esclusioni di responsabilità",
    "s13-text": "<p>Salvo quanto espressamente previsto, il Servizio (incluse le funzionalità IA) è fornito \"così com’è\" e \"come disponibile\". Non promettiamo che i risultati saranno accurati, completi o idonei a fini specifici. Dovresti verificare autonomamente le informazioni importanti.</p>",
    "s14-heading": "14) Responsabilità (formulazione UK)",
    "s14-text": "<p>Nulla in questi Termini esclude o limita la responsabilità per morte o lesioni personali causate da negligenza, frode o falsa dichiarazione fraudolenta, o altre responsabilità che non possono essere escluse o limitate per legge.</p><p><em>Se sei un consumatore:</em> Non siamo responsabili per perdite o danni non prevedibili, che avresti potuto evitare seguendo le nostre istruzioni ragionevoli, o derivanti da uso improprio del Servizio.</p><p><em>Se utilizzi il Servizio per scopi aziendali:</em> Escludiamo ogni condizione, garanzia o dichiarazione implicita nella massima misura consentita dalla legge; e la nostra responsabilità complessiva in qualsiasi periodo di 12 mesi non supererà l’importo più elevato tra £100 o le tariffe da te pagate per il Servizio in tale periodo.</p>",
    "s15-heading": "15) Indennizzo (utenti business)",
    "s15-text": "<p>Se utilizzi il Servizio per conto di un’azienda o a suo favore, accetti di tenerci indenni da reclami di terzi derivanti dal tuo uso illecito del Servizio o dalla violazione dei presenti Termini.</p>",
    "s16-heading": "16) Modifiche ai presenti Termini",
    "s16-text": "<p>Possiamo aggiornare periodicamente questi Termini. Per modifiche sostanziali forniremo un preavviso di almeno 30 giorni prima dell’entrata in vigore. Se non sei d’accordo, puoi annullare prima della data di efficacia; continuare a usare il Servizio dopo tale data implica accettazione.</p>",
    "s17-heading": "17) Legge applicabile e foro competente",
    "s17-text": "<p>I presenti Termini sono regolati dalle leggi di Inghilterra e Galles. I tribunali di Inghilterra e Galles hanno giurisdizione esclusiva, salvo che i consumatori in Scozia o Irlanda del Nord possano adire i propri tribunali locali.</p>",
    "s18-heading": "18) Varie",
    "s18-text": "<ul><li><strong>Nessuna rinuncia:</strong> Un ritardo nell’applicazione non preclude l’applicazione successiva.</li><li><strong>Separabilità:</strong> Se una parte è illegale o inapplicabile, il resto rimane efficace.</li><li><strong>Cessione:</strong> Non puoi cedere o trasferire i tuoi diritti senza il nostro consenso; noi possiamo cedere in caso di riorganizzazione o vendita.</li><li><strong>Accordo integrale:</strong> Questi Termini e la nostra Informativa sulla Privacy costituiscono l’intero accordo tra te e noi per il Servizio.</li><li><strong>Comunicazioni:</strong> Possiamo inviare avvisi via email o in-app.</li></ul>",
    "s19-heading": "19) Contatta Brainstorm Buddy",
    "s19-text": "<p>Indirizzo: 167–169 Great Portland Street, 5° piano, Londra, W1W 5PF, Regno Unito</p><p>Email: <a href=\\\"mailto:brainstormbuddyy@gmail.com\\\">brainstormbuddyy@gmail.com</a></p>",
    "footer-line": "&copy; 2025 Brainstorm Buddy. Tutti i diritti riservati."
  },
  "pt": {
    "title": "Termos de Serviço — Brainstorm Buddy",
    "dates-line": "Data de vigência: 20 de setembro de 2025 &nbsp;•&nbsp; Última atualização: 20 de setembro de 2025",
    "s1-heading": "1) Quem somos e como contactar",
    "s1-text": "<p>Brainstorm Buddy (o \"Serviço\") é fornecido por Ibrahim Ahmed (\"nós\").</p><p>Endereço: 167–169 Great Portland Street, 5º andar, Londres, W1W 5PF, Reino Unido</p><p>Email: <a href=\\\"mailto:brainstormbuddyy@gmail.com\\\">brainstormbuddyy@gmail.com</a></p><p>Se tiver uma questão ou queixa de privacidade, também pode contactar o Information Commissioner’s Office (ICO) do Reino Unido em <a href=\\\"https://ico.org.uk\\\" target=\\\"_blank\\\" rel=\\\"noopener\\\">ico.org.uk</a>.</p>",
    "s2-heading": "2) O que fazem estes Termos",
    "s2-text": "<p>Estes Termos de Serviço (\"Termos\") regulam o seu acesso e utilização do Serviço (incluindo a nossa extensão, o website e funcionalidades relacionadas). Ao utilizar o Serviço, aceita estes Termos e a nossa Política de Privacidade (ligada no rodapé do site/app). Se utilizar o Serviço em nome de uma empresa, confirma que está autorizado a vinculá-la.</p>",
    "s3-heading": "3) A sua conta",
    "s3-text": "<p>Algumas funcionalidades exigem uma conta. Mantenha as suas credenciais seguras; é responsável pela atividade na sua conta. Avise-nos prontamente se suspeitar de uso não autorizado.</p>",
    "s4-heading": "4) Conteúdo gerado por IA (importante)",
    "s4-text": "<p>O Brainstorm Buddy utiliza IA (incluindo serviços da OpenAI) para gerar ideias e rascunhos. Os resultados de IA podem ser inexatos, incompletos ou inadequados e não constituem aconselhamento profissional. Ao usar as funcionalidades de IA, aceita que:</p><ul><li>É responsável por como usa e interpreta os resultados (incluindo verificação de factos e cumprimento da lei).</li><li>Fornecemos o Serviço \"tal como está\" para fins de criatividade e produtividade e não garantimos exatidão ou adequação a um propósito específico.</li></ul>",
    "s5-heading": "5) Utilização aceitável",
    "s5-text": "<p>Não deve utilizar o Serviço para:</p><ul><li>Violar a lei ou direitos de terceiros (incluindo direitos de autor e marcas).</li><li>Produzir ou partilhar conteúdo ilegal, enganoso, prejudicial ou invasivo da privacidade; malware; ou conteúdo que facilite danos.</li><li>Apresentar resultados de IA como factos sem verificações quando a precisão é importante.</li><li>Tentar contornar limites técnicos, sondar os nossos sistemas ou criar várias contas para contornar limites.</li></ul><p>Podemos remover conteúdo, limitar o uso ou suspender/encerrar contas por infrações ou riscos para a segurança, a privacidade ou a estabilidade do sistema.</p>",
    "s6-heading": "6) Planos, limites de uso e equidade",
    "s6-text": "<p><strong>Nome do plano:</strong> Elite &nbsp;•&nbsp; <strong>Quota mensal:</strong> até 700 gerações de ideias com IA por mês por conta.</p><p>Podemos limitar temporariamente ou suspender o acesso se exceder substancialmente as quotas ou utilizar indevidamente o Serviço. É proibido criar várias contas para contornar limites. Podemos publicar limites operacionais atualizados para proteger a integridade do sistema.</p>",
    "s7-heading": "7) Preços, renovação automática, cancelamentos e reembolsos",
    "s7-text": "<ul><li><strong>Renovação automática.</strong> As subscrições (mensais ou anuais) renovam-se automaticamente até serem canceladas no website, nas definições da conta, ou contactando-nos.</li><li><strong>Período de reflexão para consumidores do Reino Unido.</strong> Se comprar online como consumidor, tem 14 dias a partir da compra para cancelar por qualquer motivo. Se pedir para iniciarmos o serviço nesse período, reconhece que, uma vez totalmente prestado, perde o direito de cancelar, podendo ser deduzido um montante proporcional pelos serviços já prestados. Para cancelar dentro do período, use o fluxo na app ou envie email para <a href=\\\"mailto:brainstormbuddyy@gmail.com\\\">brainstormbuddyy@gmail.com</a>.</li><li><strong>Reembolsos.</strong> <em>Mensais:</em> pode cancelar a qualquer momento para impedir renovações futuras. As taxas já pagas geralmente não são reembolsáveis, exceto quando se aplica o direito de reflexão de 14 dias (com eventual dedução proporcional se pediu início imediato). <em>Anuais:</em> pode cancelar dentro de 14 dias da compra ao abrigo dessas regras (com eventual dedução proporcional se início imediato). Após 14 dias, as taxas anuais não são reembolsáveis.</li><li><strong>Prazo de processamento:</strong> normalmente 5 a 10 dias úteis para o método de pagamento original.</li><li><strong>Abuso de reembolsos:</strong> Para prevenir abuso, poderemos limitar compras futuras ou recusar novos pedidos se mais de dois reembolsos tiverem sido aprovados para a mesma conta ou método de pagamento.</li><li>Notificaremos antes de qualquer alteração de preço com efeito na próxima renovação.</li></ul>",
    "s8-heading": "8) Pagamentos e serviços de terceiros",
    "s8-text": "<p>Os pagamentos são processados pela Stripe. Também usamos serviços da Google (incluindo Gmail) para comunicações e operações. Os termos e as políticas de privacidade deles aplicam-se a esses serviços. Consulte a nossa Política de Privacidade para detalhes de partilha de dados e salvaguardas.</p>",
    "s9-heading": "9) Privacidade e proteção de dados",
    "s9-text": "<p>Somos o responsável pelo tratamento dos dados pessoais processados através do Serviço. Processamos dados para fornecer, proteger e melhorar o Serviço e para comunicar consigo. Pontos-chave (consulte a Política de Privacidade para detalhes completos):</p><ul><li>Fundamentos legais podem incluir contrato, interesses legítimos e consentimento (quando aplicável).</li><li>Usamos prestadores (incluindo OpenAI, Stripe e Google) ao abrigo de contrato.</li><li>Alguns tratamentos podem ocorrer fora do Reino Unido com salvaguardas adequadas.</li><li>Os seus direitos incluem acesso, retificação, apagamento, limitação, portabilidade e oposição, e o direito de reclamar à ICO.</li></ul>",
    "s10-heading": "10) Propriedade intelectual",
    "s10-text": "<p>O Serviço, incluindo software, conteúdo e marca, é da nossa propriedade ou dos nossos licenciadores. Brainstorm Buddy é a nossa marca.</p><p><strong>Os seus inputs e resultados de IA.</strong> Mantém os direitos sobre o seu conteúdo de entrada. Para operar o Serviço, concede-nos uma licença mundial e gratuita para alojar, processar e apresentar os seus inputs e gerar resultados conforme a sua orientação. Sem prejuízo de direitos de terceiros e destes Termos, pode utilizar os resultados para os seus fins. Deve assegurar que possui todos os direitos necessários sobre os seus inputs.</p>",
    "s11-heading": "11) Alterações ao serviço e disponibilidade",
    "s11-text": "<p>Podemos atualizar ou alterar funcionalidades para melhorar o desempenho ou cumprir requisitos de segurança/legais. Se fizermos alterações materiais que o afetem negativamente, forneceremos um aviso de pelo menos 30 dias (por email ou na app) quando razoável, e poderá cancelar antes de produzirem efeito. Procuramos elevada disponibilidade, mas não garantimos serviço ininterrupto ou isento de erros. A manutenção programada será anunciada quando viável.</p>",
    "s12-heading": "12) Suspensão e rescisão",
    "s12-text": "<p>Podemos suspender ou terminar o seu acesso se violar de forma material ou repetida estes Termos ou a lei; se o seu uso representar risco para a segurança ou estabilidade; ou se exigido por lei ou por um fornecedor. Tentaremos dar um aviso razoável quando apropriado. Com a rescisão, o seu direito de uso cessa, mas as cláusulas que devem sobreviver (por exemplo, PI, limites de responsabilidade, reembolsos já processados) continuarão. Consulte a Política de Privacidade sobre retenção e eliminação.</p>",
    "s13-heading": "13) Isenções de responsabilidade",
    "s13-text": "<p>Salvo disposição expressa nestes Termos, o Serviço (incluindo funcionalidades de IA) é fornecido \"tal como está\" e \"conforme disponível\". Não prometemos que os resultados serão exatos, completos ou adequados para qualquer propósito específico. Deve verificar de forma independente as informações importantes.</p>",
    "s14-heading": "14) Responsabilidade (redação do Reino Unido)",
    "s14-text": "<p>Nada nestes Termos exclui ou limita a responsabilidade por morte ou lesões pessoais causadas por negligência, fraude ou declaração fraudulenta, ou outra responsabilidade que não possa ser excluída ou limitada por lei.</p><p><em>Se for consumidor:</em> Não somos responsáveis por perdas ou danos não previsíveis, que poderia ter evitado seguindo as nossas instruções razoáveis, ou que resultem do uso indevido do Serviço.</p><p><em>Se usar o Serviço para fins empresariais:</em> Excluímos todas as condições, garantias ou declarações implícitas na medida máxima permitida por lei; e a nossa responsabilidade total agregada em qualquer período de 12 meses não excederá o maior entre £100 ou as taxas pagas por si pelo Serviço nesse período.</p>",
    "s15-heading": "15) Indemnização (utilizadores empresariais)",
    "s15-text": "<p>Se utilizar o Serviço para ou em nome de uma empresa, concorda em indemnizar-nos contra reclamações de terceiros decorrentes do seu uso ilícito do Serviço ou da violação destes Termos.</p>",
    "s16-heading": "16) Alterações a estes Termos",
    "s16-text": "<p>Podemos atualizar estes Termos periodicamente. Para alterações materiais, daremos um aviso de pelo menos 30 dias antes de produzirem efeito. Se não concordar, pode cancelar antes da data de vigência; continuar a usar o Serviço após essa data significa que aceita as alterações.</p>",
    "s17-heading": "17) Lei aplicável e jurisdição",
    "s17-text": "<p>Estes Termos são regidos pelas leis de Inglaterra e País de Gales. Os tribunais de Inglaterra e País de Gales têm jurisdição exclusiva, salvo que consumidores na Escócia ou Irlanda do Norte podem apresentar ações nos seus tribunais locais.</p>",
    "s18-heading": "18) Disposições gerais",
    "s18-text": "<ul><li><strong>Não renúncia:</strong> Um atraso na aplicação não impede a aplicação posterior.</li><li><strong>Separabilidade:</strong> Se alguma parte for ilegal ou inexequível, o restante permanece em vigor.</li><li><strong>Cessão:</strong> Não pode ceder ou transferir os seus direitos sem o nosso consentimento; podemos ceder em caso de reorganização ou venda.</li><li><strong>Acordo integral:</strong> Estes Termos e a nossa Política de Privacidade constituem o acordo integral entre si e nós relativamente ao Serviço.</li><li><strong>Notificações:</strong> Podemos enviar avisos por email ou na app.</li></ul>",
    "s19-heading": "19) Contactar a Brainstorm Buddy",
    "s19-text": "<p>Endereço: 167–169 Great Portland Street, 5º andar, Londres, W1W 5PF, Reino Unido</p><p>Email: <a href=\\\"mailto:brainstormbuddyy@gmail.com\\\">brainstormbuddyy@gmail.com</a></p>",
    "footer-line": "&copy; 2025 Brainstorm Buddy. Todos os direitos reservados."
  }
}
