{
  "en": {
    "title": "Terms of Service",
    "effective-date": "Effective Date: July 6, 2025",
    "intro-heading": "1. Introduction",
    "intro-text": "Welcome to Brainstorm Buddy. By using our services, you agree to these terms.",
    "use-heading": "2. Use of the Extension",
    "use-text": "Brainstorm Buddy is a productivity tool powered by AI. You must use it legally and responsibly.",
    "ai-heading": "3. AI-Generated Content",
    "ai-text1": "Brainstorm Buddy uses OpenAI's ChatGPT to help you generate ideas. The output may not always be accurate.",
    "ai-text2": "By using this feature, you agree that:",
    "ai-li1": "You are responsible for how you use and interpret AI-generated content.",
    "ai-li2": "Brainstorm Buddy is not liable for decisions made based on AI suggestions.",
    "ai-text3": "This feature is provided \"as is\" for creativity and productivity only.",
    "fairuse-heading": "4. Fair Use Policy",
    "fairuse-text1": "Brainstorm Buddy is provided for individual, lawful, and reasonable use. By accessing our services, you agree to the following conditions:",
    "fairuse-li1": "The \"Unlimited\" plan offers generous usage but is subject to fair use limits to prevent abuse and ensure system stability. Excessive usage may result in temporary throttling or suspension.",
    "fairuse-li2": "Creating multiple accounts to circumvent usage limits or access restricted features is strictly prohibited.",
    "fairuse-li3": "The name \"Brainstorm Buddy\" is trademarks owned by the developer. Unauthorized use or imitation is not permitted.",
    "fairuse-li4": "You may not use the service to produce content that violates copyright, spreads misinformation, or engages in harmful or deceptive practices.",
    "fairuse-text2": "We reserve the right to limit, suspend, or terminate access to users who violate this Fair Use Policy.",
    "account-heading": "5. User Accounts",
    "account-text": "Accounts are required for certain features. You are responsible for your credentials and activity.",
    "privacy-heading": "6. Data Collection & Privacy",
    "privacy-text1": "We collect login and usage data to personalize the experience. See our Privacy Policy.",
    "privacy-text2": "We comply with UK GDPR. You may request access, changes, or deletion of your data.",
    "ip-heading": "7. Intellectual Property",
    "ip-text": "All content and branding associated with Brainstorm Buddy is the property of the developer.",
    "third-heading": "8. Third-Party Services",
    "third-text": "We integrate services like Google and OpenAI. We're not responsible for their terms or policies.",
    "termination-heading": "9. Termination",
    "termination-text": "We may suspend or terminate your access at any time for violating these terms.",
    "liability-heading": "10. Limitation of Liability",
    "liability-text": "Brainstorm Buddy is provided \"as is.\" We are not responsible for indirect or consequential damages.",
    "changes-heading": "11. Changes to Terms",
    "changes-text": "We may revise these terms at any time. Continued use implies your acceptance of any changes.",
    "contact-heading": "12. Contact",
    "contact-text": "If you have questions, contact us at brainstormbuddyy@gmail.com."
  },

  "es": {
  "title": "Términos de Servicio",
  "effective-date": "Fecha de vigencia: 6 de julio de 2025",
  "intro-heading": "1. Introducción",
  "intro-text": "Bienvenido a Brainstorm Buddy. Al usar nuestros servicios, aceptas estos términos.",
  "use-heading": "2. Uso de la extensión",
  "use-text": "Brainstorm Buddy es una herramienta de productividad impulsada por IA. Debes usarla de forma legal y responsable.",
  "ai-heading": "3. Contenido generado por IA",
  "ai-text1": "Brainstorm Buddy utiliza ChatGPT de OpenAI para ayudarte a generar ideas. El resultado puede no ser siempre preciso.",
  "ai-text2": "Al usar esta función, aceptas que:",
  "ai-li1": "Eres responsable del uso e interpretación del contenido generado por IA.",
  "ai-li2": "Brainstorm Buddy no se hace responsable de decisiones basadas en sugerencias de IA.",
  "ai-text3": "Esta función se ofrece “tal cual” solo para creatividad y productividad.",
  "fairuse-heading": "4. Política de uso justo",
  "fairuse-text1": "Brainstorm Buddy se proporciona para uso individual, legal y razonable. Al acceder a nuestros servicios, aceptas las siguientes condiciones:",
  "fairuse-li1": "El plan “Ilimitado” ofrece uso generoso pero está sujeto a límites de uso justo para evitar abusos y asegurar la estabilidad del sistema. El uso excesivo puede resultar en restricciones temporales o suspensión.",
  "fairuse-li2": "Crear múltiples cuentas para eludir límites de uso o acceder a funciones restringidas está estrictamente prohibido.",
  "fairuse-li3": "El nombre \"Brainstorm Buddy\" es una marca registrada propiedad del desarrollador. No se permite su uso o imitación no autorizada.",
  "fairuse-li4": "No puedes usar el servicio para producir contenido que viole derechos de autor, difunda desinformación o participe en prácticas dañinas o engañosas.",
  "fairuse-text2": "Nos reservamos el derecho de limitar, suspender o terminar el acceso a usuarios que violen esta Política de Uso Justo.",
  "account-heading": "5. Cuentas de usuario",
  "account-text": "Se requieren cuentas para ciertas funciones. Eres responsable de tus credenciales y actividad.",
  "privacy-heading": "6. Recopilación de datos y privacidad",
  "privacy-text1": "Recopilamos datos de inicio de sesión y uso para personalizar la experiencia. Consulta nuestra Política de Privacidad.",
  "privacy-text2": "Cumplimos con el RGPD del Reino Unido. Puedes solicitar acceso, cambios o eliminación de tus datos.",
  "ip-heading": "7. Propiedad intelectual",
  "ip-text": "Todo el contenido y la marca asociada a Brainstorm Buddy son propiedad del desarrollador.",
  "third-heading": "8. Servicios de terceros",
  "third-text": "Integramos servicios como Google y OpenAI. No somos responsables de sus términos o políticas.",
  "termination-heading": "9. Terminación",
  "termination-text": "Podemos suspender o terminar tu acceso en cualquier momento por violar estos términos.",
  "liability-heading": "10. Limitación de responsabilidad",
  "liability-text": "Brainstorm Buddy se proporciona “tal cual”. No somos responsables por daños indirectos o consecuentes.",
  "changes-heading": "11. Cambios en los términos",
  "changes-text": "Podemos revisar estos términos en cualquier momento. El uso continuado implica tu aceptación de los cambios.",
  "contact-heading": "12. Contacto",
  "contact-text": "Si tienes preguntas, contáctanos en brainstormbuddyy@gmail.com."
},

"fr": {
  "title": "Conditions d’Utilisation",
  "effective-date": "Date d’entrée en vigueur : 6 juillet 2025",
  "intro-heading": "1. Introduction",
  "intro-text": "Bienvenue sur Brainstorm Buddy. En utilisant nos services, vous acceptez ces conditions.",
  "use-heading": "2. Utilisation de l’Extension",
  "use-text": "Brainstorm Buddy est un outil de productivité alimenté par l’IA. Vous devez l’utiliser légalement et de manière responsable.",
  "ai-heading": "3. Contenu Généré par IA",
  "ai-text1": "Brainstorm Buddy utilise ChatGPT d’OpenAI pour vous aider à générer des idées. Le résultat peut ne pas toujours être exact.",
  "ai-text2": "En utilisant cette fonctionnalité, vous acceptez que :",
  "ai-li1": "Vous êtes responsable de l’utilisation et de l’interprétation du contenu généré par l’IA.",
  "ai-li2": "Brainstorm Buddy n’est pas responsable des décisions prises sur la base des suggestions de l’IA.",
  "ai-text3": "Cette fonctionnalité est fournie « en l’état » uniquement pour la créativité et la productivité.",
  "fairuse-heading": "4. Politique d’Utilisation Équitable",
  "fairuse-text1": "Brainstorm Buddy est fourni pour un usage individuel, légal et raisonnable. En accédant à nos services, vous acceptez les conditions suivantes :",
  "fairuse-li1": "Le plan « Illimité » offre une utilisation généreuse mais est soumis à des limites d’usage équitable pour éviter les abus et garantir la stabilité du système. Une utilisation excessive peut entraîner une limitation ou suspension temporaire.",
  "fairuse-li2": "Il est strictement interdit de créer plusieurs comptes pour contourner les limites d’utilisation ou accéder à des fonctionnalités restreintes.",
  "fairuse-li3": "Le nom « Brainstorm Buddy » est une marque déposée appartenant au développeur. L’utilisation ou l’imitation non autorisée est interdite.",
  "fairuse-li4": "Vous ne pouvez pas utiliser le service pour produire du contenu qui enfreint les droits d’auteur, diffuse de la désinformation ou adopte des pratiques nuisibles ou trompeuses.",
  "fairuse-text2": "Nous nous réservons le droit de limiter, suspendre ou résilier l’accès aux utilisateurs qui violent cette Politique d’Utilisation Équitable.",
  "account-heading": "5. Comptes Utilisateur",
  "account-text": "Des comptes sont requis pour certaines fonctionnalités. Vous êtes responsable de vos identifiants et de votre activité.",
  "privacy-heading": "6. Collecte de Données & Confidentialité",
  "privacy-text1": "Nous collectons les données de connexion et d’utilisation pour personnaliser l’expérience. Voir notre Politique de Confidentialité.",
  "privacy-text2": "Nous respectons le RGPD du Royaume-Uni. Vous pouvez demander l’accès, la modification ou la suppression de vos données.",
  "ip-heading": "7. Propriété Intellectuelle",
  "ip-text": "Tout le contenu et l’image de marque associés à Brainstorm Buddy sont la propriété du développeur.",
  "third-heading": "8. Services Tiers",
  "third-text": "Nous intégrons des services comme Google et OpenAI. Nous ne sommes pas responsables de leurs conditions ou politiques.",
  "termination-heading": "9. Résiliation",
  "termination-text": "Nous pouvons suspendre ou résilier votre accès à tout moment en cas de violation de ces conditions.",
  "liability-heading": "10. Limitation de Responsabilité",
  "liability-text": "Brainstorm Buddy est fourni « en l’état ». Nous ne sommes pas responsables des dommages indirects ou consécutifs.",
  "changes-heading": "11. Modifications des Conditions",
  "changes-text": "Nous pouvons modifier ces conditions à tout moment. L’utilisation continue vaut acceptation.",
  "contact-heading": "12. Contact",
  "contact-text": "Pour toute question, contactez-nous à brainstormbuddyy@gmail.com."
},
"ru": {
  "title": "Условия использования",
  "effective-date": "Дата вступления в силу: 6 июля 2025 года",
  "intro-heading": "1. Введение",
  "intro-text": "Добро пожаловать в Brainstorm Buddy. Используя наши сервисы, вы соглашаетесь с этими условиями.",
  "use-heading": "2. Использование расширения",
  "use-text": "Brainstorm Buddy — это инструмент повышения продуктивности на основе ИИ. Вы должны использовать его законно и ответственно.",
  "ai-heading": "3. Контент, созданный ИИ",
  "ai-text1": "Brainstorm Buddy использует ChatGPT от OpenAI для генерации идей. Результат может быть не всегда точным.",
  "ai-text2": "Используя эту функцию, вы соглашаетесь с тем, что:",
  "ai-li1": "Вы несёте ответственность за использование и интерпретацию контента, созданного ИИ.",
  "ai-li2": "Brainstorm Buddy не несёт ответственности за решения, принятые на основе предложений ИИ.",
  "ai-text3": "Эта функция предоставляется «как есть» исключительно для творчества и продуктивности.",
  "fairuse-heading": "4. Политика добросовестного использования",
  "fairuse-text1": "Brainstorm Buddy предоставляется для индивидуального, законного и разумного использования. Получая доступ к нашим сервисам, вы соглашаетесь со следующими условиями:",
  "fairuse-li1": "План «Неограниченный» предлагает широкие возможности, но подчиняется ограничениям добросовестного использования. Чрезмерное использование может привести к временной блокировке.",
  "fairuse-li2": "Создание нескольких аккаунтов для обхода лимитов строго запрещено.",
  "fairuse-li3": "Название «Brainstorm Buddy» являются зарегистрированными товарными знаками. Несанкционированное использование запрещено.",
  "fairuse-li4": "Вы не можете использовать сервис для создания контента, нарушающего авторские права, распространяющего дезинформацию или вводящего в заблуждение.",
  "fairuse-text2": "Мы оставляем за собой право ограничить, приостановить или прекратить доступ при нарушении условий.",
  "account-heading": "5. Учетные записи пользователей",
  "account-text": "Для доступа к определённым функциям требуется аккаунт. Вы несёте ответственность за свои данные и действия.",
  "privacy-heading": "6. Сбор данных и конфиденциальность",
  "privacy-text1": "Мы собираем данные о входе и использовании для персонализации. См. нашу Политику конфиденциальности.",
  "privacy-text2": "Мы соблюдаем требования UK GDPR. Вы можете запросить доступ, изменение или удаление своих данных.",
  "ip-heading": "7. Интеллектуальная собственность",
  "ip-text": "Все материалы и бренд Brainstorm Buddy являются собственностью разработчика.",
  "third-heading": "8. Сторонние сервисы",
  "third-text": "Мы интегрируем сервисы, такие как Google и OpenAI. Мы не несем ответственности за их условия.",
  "termination-heading": "9. Прекращение",
  "termination-text": "Мы можем приостановить или прекратить доступ в любое время при нарушении условий.",
  "liability-heading": "10. Ограничение ответственности",
  "liability-text": "Сервис предоставляется «как есть». Мы не несем ответственности за косвенный или сопутствующий ущерб.",
  "changes-heading": "11. Изменения условий",
  "changes-text": "Мы можем изменять условия в любое время. Продолжение использования означает принятие изменений.",
  "contact-heading": "12. Контакт",
  "contact-text": "По вопросам пишите на brainstormbuddyy@gmail.com."
},
"it": {
  "title": "Termini di Servizio",
  "effective-date": "Data di entrata in vigore: 6 luglio 2025",
  "intro-heading": "1. Introduzione",
  "intro-text": "Benvenuto in Brainstorm Buddy. Usando i nostri servizi, accetti questi termini.",
  "use-heading": "2. Uso dell'Estensione",
  "use-text": "Brainstorm Buddy è uno strumento di produttività basato su IA. Usalo legalmente e responsabilmente.",
  "ai-heading": "3. Contenuti generati da IA",
  "ai-text1": "Brainstorm Buddy utilizza ChatGPT di OpenAI per aiutarti a generare idee. Il risultato potrebbe non essere sempre preciso.",
  "ai-text2": "Usando questa funzionalità, accetti che:",
  "ai-li1": "Sei responsabile di come utilizzi e interpreti i contenuti generati dall’IA.",
  "ai-li2": "Brainstorm Buddy non è responsabile delle decisioni prese in base ai suggerimenti dell’IA.",
  "ai-text3": "Questa funzione è fornita \"così com'è\" per scopi creativi e produttivi.",
  "fairuse-heading": "4. Politica di uso corretto",
  "fairuse-text1": "Brainstorm Buddy è fornito per uso personale, legale e ragionevole. Accedendo ai servizi accetti le seguenti condizioni:",
  "fairuse-li1": "Il piano \"Illimitato\" consente un utilizzo generoso ma soggetto a limiti di uso corretto. Un uso eccessivo può portare a sospensione temporanea.",
  "fairuse-li2": "È vietato creare più account per eludere i limiti o accedere a funzionalità bloccate.",
  "fairuse-li3": "Il nome \"Brainstorm Buddy\" è un marchio registrato. L’uso non autorizzato non è consentito.",
  "fairuse-li4": "Non puoi usare il servizio per generare contenuti illegali, dannosi o fuorvianti.",
  "fairuse-text2": "Ci riserviamo il diritto di limitare o terminare l’accesso se violi questi termini.",
  "account-heading": "5. Account utente",
  "account-text": "Alcune funzioni richiedono un account. Sei responsabile delle tue credenziali e attività.",
  "privacy-heading": "6. Raccolta dati e privacy",
  "privacy-text1": "Raccogliamo dati di accesso e utilizzo per migliorare l’esperienza. Consulta la nostra Privacy Policy.",
  "privacy-text2": "Rispettiamo il GDPR UK. Puoi richiedere accesso, modifiche o cancellazione dei dati.",
  "ip-heading": "7. Proprietà intellettuale",
  "ip-text": "Tutti i contenuti e il marchio sono di proprietà dello sviluppatore.",
  "third-heading": "8. Servizi di terze parti",
  "third-text": "Usiamo servizi come Google e OpenAI. Non siamo responsabili per i loro termini.",
  "termination-heading": "9. Terminazione",
  "termination-text": "Possiamo sospendere l’accesso in caso di violazione dei termini.",
  "liability-heading": "10. Limitazione di responsabilità",
  "liability-text": "Brainstorm Buddy è fornito \"così com’è\". Non ci assumiamo responsabilità per danni indiretti.",
  "changes-heading": "11. Modifiche ai termini",
  "changes-text": "Possiamo aggiornare i termini in qualsiasi momento. Continuare a usare il servizio equivale ad accettarli.",
  "contact-heading": "12. Contatto",
  "contact-text": "Per qualsiasi domanda, contattaci a brainstormbuddyy@gmail.com."
},
"pt": {
  "title": "Termos de Serviço",
  "effective-date": "Data de vigência: 6 de julho de 2025",
  "intro-heading": "1. Introdução",
  "intro-text": "Bem-vindo ao Brainstorm Buddy. Ao usar nossos serviços, você concorda com estes termos.",
  "use-heading": "2. Uso da Extensão",
  "use-text": "O Brainstorm Buddy é uma ferramenta de produtividade com IA. Você deve usá-la de forma legal e responsável.",
  "ai-heading": "3. Conteúdo gerado por IA",
  "ai-text1": "Brainstorm Buddy usa o ChatGPT da OpenAI para ajudar na geração de ideias. O conteúdo pode não ser sempre preciso.",
  "ai-text2": "Ao usar este recurso, você concorda que:",
  "ai-li1": "Você é responsável por como interpreta e usa o conteúdo gerado pela IA.",
  "ai-li2": "O Brainstorm Buddy não é responsável por decisões tomadas com base em sugestões da IA.",
  "ai-text3": "Este recurso é fornecido \"como está\" apenas para fins criativos e de produtividade.",
  "fairuse-heading": "4. Política de Uso Justo",
  "fairuse-text1": "O Brainstorm Buddy é fornecido para uso pessoal, legal e razoável. Ao usá-lo, você concorda com os seguintes termos:",
  "fairuse-li1": "O plano \"Ilimitado\" permite uso generoso, mas está sujeito a limites de uso justo. Uso excessivo pode levar à limitação ou suspensão.",
  "fairuse-li2": "É proibido criar várias contas para contornar restrições.",
  "fairuse-li3": "O nome Brainstorm Buddy é uma marca registrada. Uso não autorizado é proibido.",
  "fairuse-li4": "Você não pode usar o serviço para gerar conteúdo ilegal, enganoso ou prejudicial.",
  "fairuse-text2": "Reservamo-nos o direito de limitar, suspender ou encerrar o acesso de usuários que violem esta política.",
  "account-heading": "5. Contas de Usuário",
  "account-text": "Algumas funções exigem uma conta. Você é responsável por suas credenciais e atividades.",
  "privacy-heading": "6. Coleta de Dados & Privacidade",
  "privacy-text1": "Coletamos dados de acesso e uso para melhorar a experiência. Veja nossa Política de Privacidade.",
  "privacy-text2": "Estamos em conformidade com o GDPR do Reino Unido. Você pode solicitar acesso, alteração ou exclusão de seus dados.",
  "ip-heading": "7. Propriedade Intelectual",
  "ip-text": "Todo o conteúdo e marca do Brainstorm Buddy pertencem ao desenvolvedor.",
  "third-heading": "8. Serviços de Terceiros",
  "third-text": "Utilizamos serviços como Google e OpenAI. Não somos responsáveis por seus termos.",
  "termination-heading": "9. Encerramento",
  "termination-text": "Podemos encerrar o acesso a qualquer momento se os termos forem violados.",
  "liability-heading": "10. Limitação de Responsabilidade",
  "liability-text": "O Brainstorm Buddy é fornecido \"como está\". Não nos responsabilizamos por danos indiretos.",
  "changes-heading": "11. Alterações nos Termos",
  "changes-text": "Podemos alterar estes termos a qualquer momento. O uso contínuo implica aceitação.",
  "contact-heading": "12. Contato",
  "contact-text": "Se tiver dúvidas, entre em contato via brainstormbuddyy@gmail.com."
}
}
  
  